app/controllers/articles_controller.rb

	def update
	  @article = Article.find(params[:id])
		@article.update(title: params[:title], description: params[:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-03-13 15:18:05.384853"], ["id", 1]]